/**			                                                    
		   ____                    _____ _______ _____       @塔克创新
		  / __ \                  / ____|__   __|  __ \ 
		 | |  | |_ __   ___ _ __ | |       | |  | |__) |
		 | |  | | '_ \ / _ \ '_ \| |       | |  |  _  / 
		 | |__| | |_) |  __/ | | | |____   | |  | | \ \ 
		  \____/| .__/ \___|_| |_|\_____|  |_|  |_|  \_\
				| |                                     
				|_|                OpenCTR   机器人控制器
									 
  ****************************************************************************** 
  *           
  * 版权所有： @塔克创新  版权所有，盗版必究
  * 公司网站： www.xtark.cn   www.tarkbot.com
  * 淘宝店铺： https://xtark.taobao.com  
  * 塔克微信： 塔克创新（关注公众号，获取最新更新资讯）
  *                              
  ******************************************************************************
  * @作  者  Musk Han@XTARK
  * @版  本  V1.0
  * @日  期  2019-7-26
  * @内  容  MPU6050 DMP操作
  *
  ******************************************************************************
  */ 
  
  
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __AX_MPU6050_DMP_H
#define __AX_MPU6050_DMP_H

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"

/*** MPU6050 DMP操作函数 **********/
void AX_MPU6050_DMP_Init(void);    //MPU6050 DMP初始化
void AX_MPU6050_DMP_GetData(int16_t *gyro, int16_t *acc, int16_t *angle);
//void AX_MPU6050_DMP_GetData(int16_t *data);  

#endif

/******************* (C) 版权 2023 XTARK **************************************/
